Revit 2024 API
ParameterTypeId.AnalyticalElementHasAssociation Property
 "Has Association": Used for Analytical Member, Analytical Panel, Structural Columns, Structural Framing, Floors, Walls, Structural Foundation
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ForgeTypeId AnalyticalElementHasAssociation { get; }
Visual Basic
Public Shared ReadOnly Property AnalyticalElementHasAssociation As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ AnalyticalElementHasAssociation {
	ForgeTypeId^ get ();
}
See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace